<a href="https://colab.research.google.com/github/sravanthi773/pandas/blob/main/pandas_DataFrame_Merging.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
d1={
    "id":[1,2,3,4,5,6],
    "Name":["pradhan","venu","madurima","nireekshan","sanju","veeru"],
    "subject":["English","java","html","python","c","dot net"]
}
d2={
    "id":[11,12,13,14,15,16],
    "Name":["srinu","sumanth","neelima","daniel","Arjun","veeru"],
    "subject":["java","html","cpp","python","c","dot net"]
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

print(df1)
print()
print(df2)

   id        Name  subject
0   1     pradhan  English
1   2        venu     java
2   3    madurima     html
3   4  nireekshan   python
4   5       sanju        c
5   6       veeru  dot net

   id     Name  subject
0  11    srinu     java
1  12  sumanth     html
2  13  neelima      cpp
3  14   daniel   python
4  15    Arjun        c
5  16    veeru  dot net

In [3]:
import pandas as pd
d1={
    "id":[1,2,3,4,5,6],
    "Name":["pradhan","venu","madurima","nireekshan","sanju","veeru"],
    "subject":["English","java","html","python","c","dot net"]
}
d2={
    "id":[11,12,13,14,15,16],
    "Name":["srinu","sumanth","neelima","daniel","Arjun","veeru"],
    "subject":["java","html","cpp","python","c","dot net"]
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
inn_join=pd.merge(df1,df2,on="subject",how="inner")
print(df1)
print()
print(df2)
print()
print(inn_join)

   id        Name  subject
0   1     pradhan  English
1   2        venu     java
2   3    madurima     html
3   4  nireekshan   python
4   5       sanju        c
5   6       veeru  dot net

   id     Name  subject
0  11    srinu     java
1  12  sumanth     html
2  13  neelima      cpp
3  14   daniel   python
4  15    Arjun        c
5  16    veeru  dot net

   id_x      Name_x  subject  id_y   Name_y
0     2        venu     java    11    srinu
1     3    madurima     html    12  sumanth
2     4  nireekshan   python    14   daniel
3     5       sanju        c    15    Arjun
4     6       veeru  dot net    16    veeru

In [4]:
import pandas as pd
d1={
    "id":[1,2,3,4,5,6],
    "Name":["pradhan","venu","madurima","nireekshan","sanju","veeru"],
    "subject":["English","java","html","python","c","dot net"]
}
d2={
    "id":[11,12,13,14,15,16],
    "Name":["srinu","sumanth","neelima","daniel","Arjun","veeru"],
    "subject":["java","html","cpp","python","c","dot net"]
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
lef_join=pd.merge(df1,df2,on="subject",how="left")
print(df1)
print()
print(df2)
print()
print(lef_join)

   id        Name  subject
0   1     pradhan  English
1   2        venu     java
2   3    madurima     html
3   4  nireekshan   python
4   5       sanju        c
5   6       veeru  dot net

   id     Name  subject
0  11    srinu     java
1  12  sumanth     html
2  13  neelima      cpp
3  14   daniel   python
4  15    Arjun        c
5  16    veeru  dot net

   id_x      Name_x  subject  id_y   Name_y
0     1     pradhan  English   NaN      NaN
1     2        venu     java  11.0    srinu
2     3    madurima     html  12.0  sumanth
3     4  nireekshan   python  14.0   daniel
4     5       sanju        c  15.0    Arjun
5     6       veeru  dot net  16.0    veeru

In [9]:
import pandas as pd
d1={
    "id":[1,2,3,4,5,6],
    "Name":["pradhan","venu","madurima","nireekshan","sanju","veeru"],
    "subject":["English","java","html","python","c","dot net"]
}
d2={
    "id":[11,12,13,14,15,16],
    "Name":["srinu","sumanth","neelima","daniel","Arjun","veeru"],
    "subject":["java","html","cpp","python","c","dot net"]
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
right_join=pd.merge(df1,df2,on="subject",how="right")
print(df1)
print()
print(df2)
print()
print(right_join)

   id        Name  subject
0   1     pradhan  English
1   2        venu     java
2   3    madurima     html
3   4  nireekshan   python
4   5       sanju        c
5   6       veeru  dot net

   id     Name  subject
0  11    srinu     java
1  12  sumanth     html
2  13  neelima      cpp
3  14   daniel   python
4  15    Arjun        c
5  16    veeru  dot net

   id_x      Name_x  subject  id_y   Name_y
0   2.0        venu     java    11    srinu
1   3.0    madurima     html    12  sumanth
2   NaN         NaN      cpp    13  neelima
3   4.0  nireekshan   python    14   daniel
4   5.0       sanju        c    15    Arjun
5   6.0       veeru  dot net    16    veeru

In [10]:
import pandas as pd
d1={
    "id":[1,2,3,4,5,6],
    "Name":["pradhan","venu","madurima","nireekshan","sanju","veeru"],
    "subject":["English","java","html","python","c","dot net"]
}
d2={
    "id":[11,12,13,14,15,16],
    "Name":["srinu","sumanth","neelima","daniel","Arjun","veeru"],
    "subject":["java","html","cpp","python","c","dot net"]
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
outer_join=pd.merge(df1,df2,on="subject",how="outer")
print(df1)
print()
print(df2)
print()
print(outer_join)

   id        Name  subject
0   1     pradhan  English
1   2        venu     java
2   3    madurima     html
3   4  nireekshan   python
4   5       sanju        c
5   6       veeru  dot net

   id     Name  subject
0  11    srinu     java
1  12  sumanth     html
2  13  neelima      cpp
3  14   daniel   python
4  15    Arjun        c
5  16    veeru  dot net

   id_x      Name_x  subject  id_y   Name_y
0   1.0     pradhan  English   NaN      NaN
1   5.0       sanju        c  15.0    Arjun
2   NaN         NaN      cpp  13.0  neelima
3   6.0       veeru  dot net  16.0    veeru
4   3.0    madurima     html  12.0  sumanth
5   2.0        venu     java  11.0    srinu
6   4.0  nireekshan   python  14.0   daniel

In [11]:
import pandas as pd
d1={
    "employee":["nandu","nani","sathya","lavanya"],
    "Group":["development","HR","testing","testing"]
}
d2={
    "employee":["nani","nandu","sathya","lavanya"],
    "Hire_date":[2010,2012,2014,2016]
}
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

print(df1)
print()
print(df2)

  employee        Group
0    nandu  development
1     nani           HR
2   sathya      testing
3  lavanya      testing

  employee  Hire_date
0     nani       2010
1    nandu       2012
2   sathya       2014
3  lavanya       2016

In [12]:
import pandas as pd
d1={
    "employee":["nandu","nani","sathya","lavanya"],
    "Group":["development","HR","testing","testing"]
}
d2={
    "employee":["nani","nandu","sathya","lavanya"],
    "Hire_date":[2010,2012,2014,2016]
}
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
one_one=pd.merge(df1,df2)

print(df1)
print()
print(df2)
print()
print(one_one)

  employee        Group
0    nandu  development
1     nani           HR
2   sathya      testing
3  lavanya      testing

  employee  Hire_date
0     nani       2010
1    nandu       2012
2   sathya       2014
3  lavanya       2016

  employee        Group  Hire_date
0    nandu  development       2012
1     nani           HR       2010
2   sathya      testing       2014
3  lavanya      testing       2016

In [14]:
import pandas as pd
d1={
    "employee":["nandu","nani","sathya","lavanya"],
    "Group":["development","HR","testing","testing"]
}
d2={
    "employee":["nani","nandu","sathya","lavanya"],
    "Hire_date":[2010,2012,2014,2016]
}
d3={
    "Group":["testing","development","HR"],
    "supervisor":["shafi","sanju","santhi"]
}
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
df3=pd.DataFrame(d3)

one_one=pd.merge(df1,df2)
many_one=pd.merge(one_one,df3)

print(df1)
print()
print(df2)
print()
print(many_one)

  employee        Group
0    nandu  development
1     nani           HR
2   sathya      testing
3  lavanya      testing

  employee  Hire_date
0     nani       2010
1    nandu       2012
2   sathya       2014
3  lavanya       2016

  employee        Group  Hire_date supervisor
0    nandu  development       2012      sanju
1     nani           HR       2010     santhi
2   sathya      testing       2014      shafi
3  lavanya      testing       2016      shafi

In [17]:
import pandas as pd
d1={
    "employee":["nandu","nani","sathya","lavanya"],
    "Group":["Development","HR","testing","testing"]
}
d2={
    "Group":["testing","testing","HR","HR","Development","Development"],
    "skills":["manual","automation","coding","logical","spreadsheets","Organization"]
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

many_many=pd.merge(df1,df2)

print(df1)
print()
print(df2)
print()
print(many_many)

  employee        Group
0    nandu  Development
1     nani           HR
2   sathya      testing
3  lavanya      testing

         Group        skills
0      testing        manual
1      testing    automation
2           HR        coding
3           HR       logical
4  Development  spreadsheets
5  Development  Organization

  employee        Group        skills
0    nandu  Development  spreadsheets
1    nandu  Development  Organization
2     nani           HR        coding
3     nani           HR       logical
4   sathya      testing        manual
5   sathya      testing    automation
6  lavanya      testing        manual
7  lavanya      testing    automation